<img src="images/olympic.jpg" alt="Alternative text" />

# üèãÔ∏è‚Äç‚ôÄÔ∏è OLYMPIC GAME HISTORY ANALYSIS üèãÔ∏è‚Äç‚ôÄÔ∏è

## Conda environment creation
conda create --prefix ./env pandas numpy matplotlib jupyter scikit-learn plotly

## DATASET

### Download
https://www.kaggle.com/code/nehagupta09/olympic-analysis-till-2016



### Context
This is a historical dataset on the modern Olympic Games, including all the Games from Athens 1896 to Rio 2016. The data was scraped from www.sports-reference.com in May 2018.

Note that the Winter and Summer Games were held in the same year up until 1992. After that, they staggered them such that Winter Games occur on a four year cycle starting with 1994, then Summer in 1996, then Winter in 1998, and so on. A common mistake people make when analyzing this data is to assume that the Summer and Winter Games have always been staggered.

### Data dictionary
The file athlete_events.csv contains 271116 rows and 15 columns

* ID - Unique number for each athlete
* Name - Athlete's name
* Sex - M or F
* Age - Integer
* Height - In centimeters
* Weight - In kilograms
* Team - Team name
* NOC - National Olympic Committee 3-letter code
* Games - Year and season
* Year - Integer
* Season - Summer or Winter
* City - Host city
* Sport - Sport
* Event - Event
* Medal - Gold, Silver, Bronze, or NA

In [60]:
# Import Libraries
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.figure_factory as ff

## Data import & initial review

1. Import the downloaded dataset
2. View the dataset structure
3. Display some example rows
4. Check for null values

In [61]:
# Import the data
df = pd.read_csv('data/athlete_events.csv')
df_region = pd.read_csv('data/noc_regions.csv')

In [62]:
# Display the table information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

In [63]:
# Display the first 10 rows
df.head(10)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
5,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
6,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,Speed Skating Women's 500 metres,NaN
7,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
8,5,Christine Jacoba Aaftink,F,27.0,185.0,82.0,Netherlands,NED,1994 Winter,1994,Winter,Lillehammer,Speed Skating,Speed Skating Women's 500 metres,NaN
9,5,Christine Jacoba Aaftink,F,27.0,185.0,82.0,Netherlands,NED,1994 Winter,1994,Winter,Lillehammer,Speed Skating,"Speed Skating Women's 1,000 metres",NaN

In [64]:
# Check if there are any fields with missing data
df.isna().sum()

ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight     62875
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     231333
dtype: int64

## Data manipulation

In [65]:
# Merge the dataset to include region
df = df.merge(df_region, on='NOC', how='left')
df.head().T

,0,1,2,3,4
ID,1,2,3,4,5
Name,A Dijiang,A Lamusi,Gunnar Nielsen Aaby,Edgar Lindenau Aabye,Christine Jacoba Aaftink
Sex,M,M,M,M,F
Age,24.0,23.0,24.0,34.0,21.0
Height,180.0,170.0,NaN,NaN,185.0
Weight,80.0,60.0,NaN,NaN,82.0
Team,China,China,Denmark,Denmark/Sweden,Netherlands
NOC,CHN,CHN,DEN,DEN,NED
Games,1992 Summer,2012 Summer,1920 Summer,1900 Summer,1988 Winter
Year,1992,2012,1920,1900,1988
Season,Summer,Summer,Summer,Summer,Winter
City,Barcelona,London,Antwerpen,Paris,Calgary
Sport,Basketball,Judo,Football,Tug-Of-War,Speed Skating
Event,Basketball Men's Basketball,Judo Men's Extra-Lightweight,Football Men's Football,Tug-Of-War Men's Tug-Of-War,Speed Skating Women's 500 metres
Medal,NaN,NaN,NaN,Gold,NaN
region,China,China,Denmark,Denmark,Netherlands
notes,NaN,NaN,NaN,NaN,NaN

In [66]:
# Remove the notes column
df = df.drop(['notes'], axis=1)
df.rename(columns = {'region':'Region'}, inplace = True)

In [67]:
# Change the dtypes of certain fields to category
for col in ['Sex', 'Team', 'NOC', 'Games', 'Season', 'City', 'Sport', 'Event', 'Medal', 'Region']:
    df[col] = df[col].astype('category')
    
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 271116 entries, 0 to 271115
Data columns (total 16 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  category
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  category
 7   NOC     271116 non-null  category
 8   Games   271116 non-null  category
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  category
 11  City    271116 non-null  category
 12  Sport   271116 non-null  category
 13  Event   271116 non-null  category
 14  Medal   39783 non-null   category
 15  Region  270746 non-null  category
dtypes: category(10), float64(3), int64(2), object(1)
memory usage: 18.2+ MB

In [68]:
# Check for duplicate rows and delete them
print(f'Duplicate rows: {df.duplicated().sum()}')
print('Removing duplicate rows...')
df.drop_duplicates(inplace=True)
print('Duplicate rows removed :)')

Duplicate rows: 1385
Removing duplicate rows...
Duplicate rows removed :)

In [ ]:
# Create 3 new columns, Gold, Silver & Bronze
# Add a 1 or 0 value for whether or not that athlete won a particular medal.
df=pd.concat([df,pd.get_dummies(df['Medal'])],axis=1)
df.head().T

## Data exploration

### Medal distribution
* Number of medals for all athletes, all disciplines, throughout Olympic history.

In [85]:
df['Medal'].value_counts()

Gold      13369
Bronze    13295
Silver    13108
Name: Medal, dtype: int64

### Total medals per region
* Total medals distributed
* Includes medals for each member of a team sport

In [84]:
df.groupby('Region',).sum(numeric_only=True)[['Gold', 'Silver', 'Bronze']].sort_values('Gold', ascending=False).reset_index()

            Region  Gold  Silver  Bronze
0              USA  2638    1641    1358
1           Russia  1599    1170    1178
2          Germany  1301    1195    1260
3               UK   677     739     651
4            Italy   575     531     531
..             ...   ...     ...     ...
200       Honduras     0       0       0
201         Guyana     0       0       1
202  Guinea-Bissau     0       0       0
203         Guinea     0       0       0
204        Liberia     0       0       0

[205 rows x 4 columns]

In [80]:
# Number of medals per region (only counts a single medal for a team sport)

medal_discipline_total = df.drop_duplicates(subset=['Team', 'NOC', 'Games','Year','City','Sport','Season','Event','Medal'])
medal_discipline_total = medal_discipline_total.groupby('Region').sum(numeric_only=True)[['Gold','Silver','Bronze']].sort_values('Gold', ascending=False).reset_index()
medal_discipline_total['Total'] = medal_discipline_total['Gold'] + medal_discipline_total['Silver'] + medal_discipline_total['Bronze']
medal_discipline_total

            Region  Gold  Silver  Bronze  Total
0              USA  1131     901     792   2824
1           Russia   727     600     589   1916
2          Germany   580     592     597   1769
3               UK   289     321     312    922
4           France   265     287     334    886
..             ...   ...     ...     ...    ...
200       Honduras     0       0       0      0
201         Guyana     0       0       1      1
202  Guinea-Bissau     0       0       0      0
203         Guinea     0       0       0      0
204        Liberia     0       0       0      0

[205 rows x 5 columns]